src/Documents/ВедомостьПоОкладам/ВедомостьПоОкладам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьПоОкладам</name>
  <posting>Deny</posting>
  <attributes>
    <name>РабочихЧасовВМесяце</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НакладныеРасходы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>РабочихЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Оклад</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкладФактический</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПремии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Премия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Итого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>П1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>П2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>П3</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>П4</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>П5</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Skype</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефоныМестные</name>
    <comment>Местные телефоны (IP)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>22</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефоны</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СервисЦентр</name>
    <type>
      <types>CatalogRef.СервисЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяЛинейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЛинейкиПроизводства</name>
    <attributes>
      <name>Линейка</name>
      <type>
        <types>CatalogRef.Линейки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/ВедомостьПоОкладам/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не Объект.Ссылка.Пустая() Тогда
		Если ПараметрыСеанса.Пользователь.Подразделения.Найти(Объект.Подразделение,"Подразделение") = Неопределено Тогда
		Сообщить("У Вас нет прав для просмотра этого документа!");
		Отказ = Истина;
		Возврат;
		КонецЕсли;
			Если Не ПараметрыСеанса.Пользователь.Должность.ПросмотрВсехДокументовРазрешенныхПодразделений Тогда	
				Если ПараметрыСеанса.Пользователь <> Объект.Автор Тогда
				Сообщить("У Вас нет прав для просмотра этого документа!");
				Отказ = Истина;
				КонецЕсли; 
			КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
Элементы.ТабличнаяЧастьПодразделение.Видимость = Объект.НакладныеРасходы;
ЭтотОбъект.ТолькоПросмотр = ОбщийМодульСозданиеДокументов.ЗапретРедактирования(Объект.Ссылка,Истина,Истина);
КонецПроцедуры

&НаСервере
Функция ПечатьПредставлениеНаПремированиеНаСервере()
ТабДок = Новый ТабличныйДокумент;

ОбъектЗн = РеквизитФормыВЗначение("Объект");
Макет = ОбъектЗн.ПолучитьМакет("ПредставлениеНаПремирование");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблСтрока = Макет.ПолучитьОбласть("Строка");
ОблКонец = Макет.ПолучитьОбласть("Конец");

ОблШапка.Параметры.Директор = ОбщийМодульВызовСервера.ПолучитьСотрудникаПоДолжности("Директор завода");
ОблШапка.Параметры.ГодДаты = Формат(КонецМесяца(Объект.Дата),"ДФ=yyyy");
ОблШапка.Параметры.ДатаНач = Формат(НачалоМесяца(Объект.Дата),"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.ДатаКон = Формат(КонецМесяца(Объект.Дата),"ДФ=dd.MM.yyyy");
ОблШапка.Параметры.Подразделение = Объект.Подразделение;
ОблШапка.Параметры.Комментарий = Объект.Комментарий;
ТабДок.Вывести(ОблШапка);
ОкладВсего = 0;
	Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл
	ОблСтрока.Параметры.Заполнить(ТЧ);
	ОблСтрока.Параметры.ПроцентПремииМаксимальный = ТЧ.Исполнитель.Должность.ПроцентПремииМаксимальный;
	ОблСтрока.Параметры.Сотрудник = СокрЛП(ТЧ.Исполнитель.Наименование);
	Оклад = ПолучитьОклад(ТЧ.Исполнитель);
	ОблСтрока.Параметры.Оклад = Оклад;
	ТабДок.Вывести(ОблСтрока);
	ОкладВсего = ОкладВсего + Оклад;
	КонецЦикла;
ОблКонец.Параметры.Мастер = Объект.Автор;
ОблКонец.Параметры.ОкладВсего = ОкладВсего;
ОблКонец.Параметры.ОкладФактическийВсего = Объект.ТабличнаяЧасть.Итог("ОкладФактический");
ОблКонец.Параметры.ПремияВсего = Объект.ТабличнаяЧасть.Итог("Премия");
ОблКонец.Параметры.Документ = Объект.Ссылка;
ТабДок.Вывести(ОблКонец);
Возврат(ТабДок);
КонецФункции

&НаКлиенте
Процедура ПечатьПредставлениеНаПремирование(Команда)
ТД = ПечатьПредставлениеНаПремированиеНаСервере();
ТД.Показать("Представление на премирование");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
Отказ = Не ЭтаФорма.ПроверитьЗаполнение();
КонецПроцедуры

&НаКлиенте
Процедура РабочихЧасовВМесяцеПриИзменении(Элемент)
	Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл
	ТЧ.ОкладФактический = ПолучитьОклад(ТЧ.Исполнитель)/Объект.РабочихЧасовВМесяце*ТЧ.РабочихЧасов;
	ТЧ.Премия = ТЧ.ОкладФактический/100*ТЧ.ПроцентПремии;
	ТЧ.Итого = ТЧ.ОкладФактический+ТЧ.Премия;
	КонецЦикла; 
КонецПроцедуры

&НаСервере
Функция ПолучитьОклад(Исполнитель)
Возврат(Исполнитель.Должность.Оклад);
КонецФункции

&НаКлиенте
Процедура ТабличнаяЧастьРабочихЧасовПриИзменении(Элемент)
ТЧ = Элементы.ТабличнаяЧасть.ТекущиеДанные;
ТЧ.ОкладФактический = ПолучитьОклад(ТЧ.Исполнитель)/Объект.РабочихЧасовВМесяце*ТЧ.РабочихЧасов;
ТЧ.Премия = ТЧ.ОкладФактический/100*ТЧ.ПроцентПремии;
ТЧ.Итого = ТЧ.ОкладФактический+ТЧ.Премия;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьП1ПриИзменении(Элемент)
ТЧ = Элементы.ТабличнаяЧасть.ТекущиеДанные;
ТЧ.ПроцентПремии = ТЧ.П1+ТЧ.П2+ТЧ.П3+ТЧ.П4+ТЧ.П5;
ТЧ.Премия = ТЧ.ОкладФактический/100*ТЧ.ПроцентПремии;
ТЧ.Итого = ТЧ.ОкладФактический+ТЧ.Премия;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьП2ПриИзменении(Элемент)
ТЧ = Элементы.ТабличнаяЧасть.ТекущиеДанные;
ТЧ.ПроцентПремии = ТЧ.П1+ТЧ.П2+ТЧ.П3+ТЧ.П4+ТЧ.П5;
ТЧ.Премия = ТЧ.ОкладФактический/100*ТЧ.ПроцентПремии;
ТЧ.Итого = ТЧ.ОкладФактический+ТЧ.Премия;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьП3ПриИзменении(Элемент)
ТЧ = Элементы.ТабличнаяЧасть.ТекущиеДанные;
ТЧ.ПроцентПремии = ТЧ.П1+ТЧ.П2+ТЧ.П3+ТЧ.П4+ТЧ.П5;
ТЧ.Премия = ТЧ.ОкладФактический/100*ТЧ.ПроцентПремии;
ТЧ.Итого = ТЧ.ОкладФактический+ТЧ.Премия;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьП4ПриИзменении(Элемент)
ТЧ = Элементы.ТабличнаяЧасть.ТекущиеДанные;
ТЧ.ПроцентПремии = ТЧ.П1+ТЧ.П2+ТЧ.П3+ТЧ.П4+ТЧ.П5;
ТЧ.Премия = ТЧ.ОкладФактический/100*ТЧ.ПроцентПремии;
ТЧ.Итого = ТЧ.ОкладФактический+ТЧ.Премия;
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЧастьП5ПриИзменении(Элемент)
ТЧ = Элементы.ТабличнаяЧасть.ТекущиеДанные;
ТЧ.ПроцентПремии = ТЧ.П1+ТЧ.П2+ТЧ.П3+ТЧ.П4+ТЧ.П5;
ТЧ.Премия = ТЧ.ОкладФактический/100*ТЧ.ПроцентПремии;
ТЧ.Итого = ТЧ.ОкладФактический+ТЧ.Премия;
КонецПроцедуры

&НаСервере
Функция ПолучитьНаименованиеПодразделения()
Возврат(СокрЛП(Объект.Подразделение.Наименование));
КонецФункции

&НаКлиенте
Процедура ПодразделениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ОбщийМодульВызовСервера.РазрешенноеПодразделение(ВыбранноеЗначение) Тогда
	Сообщить("У Вас нет прав для создания документа по выбранному подразделению!");
	СтандартнаяОбработка = Ложь;
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьСотрудника(Сотрудник)
Возврат(Новый Структура("Наименование,Код",СокрЛП(Сотрудник.Наименование),СокрЛП(Сотрудник.ТабельныйНомер)));
КонецФункции

&НаКлиенте
Процедура Выгрузить(Команда)
НастройкиОбменаДанными = ОбщийМодульСинхронизации.ПолучитьНастройкиОбменаДанными("Зарплата");
V7 = ОбщийМодульКлиент.ПодключитьсяК1С77(НастройкиОбменаДанными.ПутьКБазеДанных,НастройкиОбменаДанными.Пользователь,НастройкиОбменаДанными.Пароль);
	Если V7 = Неопределено Тогда
	Возврат;	
	КонецЕсли;
Состояние("Обработка...",,"Выгрузка данных...");
Сотрудники = V7.CreateObject("Справочник.Сотрудники");
ВидыРасчетов = V7.CreateObject("Справочник.ВидыРасчетов");
ЗарплатаПремия = V7.CreateObject("Документ.НачисленияУдержанияСписком");

ЗарплатаПремия.Новый();	
ЗарплатаПремия.ДатаДок = Объект.Дата;
ЗарплатаПремия.УстановитьНовыйНомер("П"+Прав(Год(Объект.Дата),2)+"-");
ВидыРасчетов.НайтиПоНаименованию("Премия месячная(сумм)",0,1);
ЗарплатаПремия.Расчет = ВидыРасчетов.Расчет;
ЗарплатаПремия.Комментарий = "Премия за период с "+Формат(НачалоМесяца(Объект.Дата),"ДФ=dd.MM.yyyy")+" по "+Формат(КонецМесяца(Объект.Дата),"ДФ=dd.MM.yyyy") + "; мастер: "+Объект.Автор;
	Для каждого ТЧ Из Объект.ТабличнаяЧасть Цикл
	Исполнитель = ПолучитьСотрудника(ТЧ.Исполнитель);
		Если Сотрудники.НайтиПоКоду(Исполнитель.Код,0) = 1 Тогда
			Если СокрЛП(Сотрудники.Наименование) = Исполнитель.Наименование Тогда				 
			ЗарплатаПремия.НоваяСтрока();                          		
			ЗарплатаПремия.Сотрудник = Сотрудники.ТекущийЭлемент();
			ЗарплатаПремия.Начало = НачалоМесяца(Объект.Дата);
			ЗарплатаПремия.Окончание = КонецМесяца(Объект.Дата);
			ЗарплатаПремия.НазначитьТип("Величина","Число", 10, 2);
			ЗарплатаПремия.Величина = ТЧ.Премия;			
			Иначе
			Сообщить("Сотрудник "+ТЧ.Исполнитель+" не найден!");
			КонецЕсли; 
		Иначе
		Сообщить("Сотрудник "+ТЧ.Исполнитель+" не найден!");
		КонецЕсли;
	КонецЦикла;                                             
ЗарплатаПремия.Записать();
Сообщить("Создан документ Ввод расчёта списку сотрудников №"+ЗарплатаПремия.НомерДок); 	
КонецПроцедуры

&НаКлиенте
Процедура НакладныеРасходыПриИзменении(Элемент)
Элементы.ТабличнаяЧастьПодразделение.Видимость = Объект.НакладныеРасходы;
КонецПроцедуры
